[{
        "id": "CH-0001",
        "name": "Beijing Kaoya",
        "description": "Beijing Kaoya, also known as Peking Duck, is a famous Chinese dish that features crispy duck skin and tender meat wrapped in thin pancakes with hoisin sauce, cucumber, and green onions. The duck is traditionally roasted until the skin is golden and crispy, resulting in a delightful combination of flavors and textures.",
        "image": "data/images/chiD_img/beijing_kaoya.jpg",
        "recipe": {
            "ingredients": [
                "1 whole duck (about 5-6 pounds)",
                "2 tablespoons honey",
                "2 tablespoons soy sauce",
                "1 tablespoon Chinese five-spice powder",
                "Salt, to taste",
                "Thin pancakes (store-bought or homemade)",
                "Hoisin sauce",
                "Sliced cucumbers",
                "Sliced green onions"
            ],
            "instructions": [
                "Preheat the oven to 350°F (175°C).",
                "Remove any excess fat from the duck and rinse it under cold water. Pat dry with paper towels.",
                "In a small bowl, mix together the honey, soy sauce, and Chinese five-spice powder.",
                "Brush the duck with the honey mixture, making sure to coat it evenly.",
                "Sprinkle salt over the duck, inside and out.",
                "Place the duck on a rack in a roasting pan, breast side up.",
                "Roast the duck in the preheated oven for 1.5 to 2 hours, or until the skin is golden brown and crispy, and the internal temperature reaches 165°F (75°C).",
                "Remove the duck from the oven and let it rest for 10-15 minutes before carving.",
                "To serve, carve the duck into thin slices and arrange them on a platter.",
                "Serve the sliced duck with thin pancakes, hoisin sauce, sliced cucumbers, and green onions. To eat, spread hoisin sauce on a pancake, add a few slices of duck, some cucumber, and green onions, then roll it up and enjoy!"
            ]
        }
    },
    {
        "id": "CH-0002",
        "name": "Crystal Dumplings",
        "description": "Crystal Dumplings, also called Har Gow, are translucent dumplings filled with shrimp and sometimes bamboo shoots. The dumpling wrapper is made from a combination of wheat starch and tapioca flour, giving it a chewy yet delicate texture. These dumplings are typically steamed and served as a delicious appetizer or snack.",
        "image": "data/images/chiD_img/crystal_dumplings.jpg",
        "recipe": {
            "ingredients": [
                "For the dumpling wrapper:",
                "1 cup wheat starch",
                "¼ cup tapioca flour",
                "¾ cup boiling water",
                "For the filling:",
                "½ pound raw shrimp, peeled, deveined, and chopped",
                "2 tablespoons bamboo shoots, finely chopped",
                "1 tablespoon soy sauce",
                "1 teaspoon sesame oil",
                "½ teaspoon sugar",
                "Pinch of white pepper",
                "For assembling:",
                "Cornstarch, for dusting"
            ],
            "instructions": [
                "To make the dumpling wrapper, combine the wheat starch and tapioca flour in a mixing bowl.",
                "Gradually add the boiling water to the flour mixture, stirring constantly, until a dough forms.",
                "Knead the dough until smooth and elastic. Cover with a damp cloth and let it rest for 20-30 minutes.",
                "While the dough is resting, prepare the filling. In a separate bowl, mix together the chopped shrimp, bamboo shoots, soy sauce, sesame oil, sugar, and white pepper.",
                "Divide the dough into small pieces and roll each piece into a ball. Keep the dough covered with a damp cloth to prevent it from drying out.",
                "On a lightly floured surface, flatten each dough ball into a thin circle, about 3 inches in diameter.",
                "Place a spoonful of filling in the center of each dough circle. Fold the edges of the dough over the filling and pinch to seal, forming a pleated edge.",
                "Repeat with the remaining dough and filling.",
                "Steam the dumplings in a bamboo steamer lined with parchment paper or cabbage leaves, for 8-10 minutes, or until the filling is cooked through and the wrapper is translucent.",
                "Serve the crystal dumplings hot with soy sauce or your favorite dipping sauce."
            ]
        }
    },
    {
        "id": "CH-0003",
        "name": "Dapanji",
        "description": "Dapanji, or Big Plate Chicken, is a hearty Xinjiang dish consisting of tender chicken pieces, potatoes, bell peppers, and onions cooked in a rich and spicy tomato-based sauce. This dish is known for its bold flavors and generous portions, making it a favorite among those who enjoy spicy and comforting meals.",
        "image": "data/images/chiD_img/dapanji.jpg",
        "recipe": {
            "ingredients": [
                "2 pounds chicken thighs, cut into bite-sized pieces",
                "2 potatoes, peeled and cut into chunks",
                "2 bell peppers, seeded and sliced",
                "1 onion, sliced",
                "4 cloves garlic, minced",
                "2 tablespoons vegetable oil",
                "1 can (14 oz) diced tomatoes",
                "2 tablespoons tomato paste",
                "2 cups chicken broth",
                "2 tablespoons soy sauce",
                "1 tablespoon chili powder",
                "1 teaspoon ground cumin",
                "1 teaspoon paprika",
                "Salt and pepper, to taste",
                "Fresh cilantro, for garnish"
            ],
            "instructions": [
                "In a large skillet or wok, heat the vegetable oil over medium-high heat.",
                "Add the chicken pieces to the skillet and cook until browned on all sides, about 5-7 minutes. Remove from the skillet and set aside.",
                "In the same skillet, add the potatoes and cook until lightly browned, about 5 minutes. Add the bell peppers, onion, and garlic, and cook for another 3-4 minutes.",
                "Stir in the diced tomatoes, tomato paste, chicken broth, soy sauce, chili powder, cumin, paprika, salt, and pepper. Bring to a simmer.",
                "Return the chicken pieces to the skillet and stir to combine with the sauce and vegetables.",
                "Cover and cook over medium-low heat for 20-25 minutes, or until the chicken is cooked through and the potatoes are tender.",
                "Adjust seasoning with salt and pepper, if needed.",
                "Garnish with fresh cilantro before serving.",
                "Serve hot with steamed rice or crusty bread."
            ]
        }
    },
    {
        "id": "CH-0004",
        "name": "Daxiaomian",
        "description": "Daxiaomian, or Big Wok Noodles, is a popular street food dish originating from Lanzhou, China. It features hand-pulled noodles served in a flavorful beef broth topped with sliced beef, green onions, and sometimes cilantro. This dish is beloved for its simplicity and satisfying taste.",
        "image": "data/images/chiD_img/daxiaomian.jpg",
        "recipe": {
            "ingredients": [
                "For the noodles:",
                "2 cups all-purpose flour",
                "¾ cup water",
                "Pinch of salt",
                "For the broth:",
                "6 cups beef broth",
                "2 tablespoons soy sauce",
                "1 tablespoon dark soy sauce",
                "1 tablespoon Shaoxing wine",
                "1 tablespoon sugar",
                "For the toppings:",
                "½ pound beef sirloin, thinly sliced",
                "2 green onions, chopped",
                "Optional: chopped cilantro, chili oil"
            ],
            "instructions": [
                "To make the noodles, combine the all-purpose flour, water, and salt in a mixing bowl.",
                "Knead the dough until smooth and elastic. Cover with a damp cloth and let it rest for 30 minutes.",
                "Divide the dough into small balls and roll each ball into a thin rope.",
                "Stretch and pull the dough rope into long, thin noodles. Repeat with the remaining dough balls.",
                "Bring a pot of water to a boil. Add the noodles and cook for 1-2 minutes, or until they float to the surface. Drain and rinse under cold water. Set aside.",
                "In a large pot, combine the beef broth, soy sauce, dark soy sauce, Shaoxing wine, and sugar. Bring to a simmer.",
                "Add the sliced beef to the broth and cook for 1-2 minutes, or until just cooked through.",
                "Divide the cooked noodles among serving bowls. Ladle the hot broth and beef over the noodles.",
                "Top with chopped green onions and optional cilantro. Serve hot with chili oil on the side, if desired."
            ]
        }
    },
    {
        "id": "CH-0005",
        "name": "Fried Rice",
        "description": "Fried Rice is a versatile Chinese dish made by stir-frying cooked rice with various ingredients such as eggs, vegetables, and meat or seafood. It is seasoned with soy sauce, oyster sauce, and other flavorings, giving it a savory and satisfying taste. Fried rice is a popular choice for using up leftover ingredients and is enjoyed as a quick and delicious meal.",
        "image": "data/images/chiD_img/fried_rice.jpg",
        "recipe": {
            "ingredients": [
                "3 cups cooked rice, preferably chilled",
                "2 eggs, lightly beaten",
                "1 cup mixed vegetables (peas, carrots, corn)",
                "½ cup cooked protein (chicken, shrimp, ham, etc.), diced",
                "2 tablespoons vegetable oil",
                "2 cloves garlic, minced",
                "2 green onions, chopped",
                "2 tablespoons soy sauce",
                "1 tablespoon oyster sauce",
                "Salt and pepper, to taste"
            ],
            "instructions": [
                "Heat 1 tablespoon of vegetable oil in a large skillet or wok over medium-high heat.",
                "Add the beaten eggs to the skillet and scramble until cooked through. Remove from the skillet and set aside.",
                "Add the remaining tablespoon of vegetable oil to the skillet. Add the minced garlic and cook until fragrant, about 30 seconds.",
                "Add the mixed vegetables and cooked protein to the skillet. Stir-fry until heated through.",
                "Add the cooked rice to the skillet, breaking up any clumps with a spatula.",
                "Drizzle the soy sauce and oyster sauce over the rice. Stir-fry until evenly coated.",
                "Add the scrambled eggs back to the skillet. Stir-fry until everything is heated through and evenly distributed.",
                "Season with salt and pepper, to taste.",
                "Garnish with chopped green onions before serving.",
                "Serve hot as a main dish or side dish."
            ]
        }
    },
    {
        "id": "CH-0006",
        "name": "Mapo Tofu",
        "description": "Mapo Tofu is a classic Sichuan dish featuring soft tofu cubes and minced meat cooked in a spicy and flavorful sauce made from doubanjiang (broad bean paste), fermented black beans, garlic, ginger, and Sichuan peppercorns. It is typically garnished with chopped green onions and served with steamed rice, providing a satisfyingly spicy and numbing sensation.",
        "image": "data/images/chiD_img/mapo_tofu.jpg",
        "recipe": {
            "ingredients": [
                "1 block (14 oz) firm tofu, cut into cubes",
                "½ pound ground pork or beef",
                "2 tablespoons doubanjiang (Sichuan chili bean paste)",
                "1 tablespoon fermented black beans, rinsed and chopped",
                "2 cloves garlic, minced",
                "1 teaspoon ginger, minced",
                "1 cup chicken or vegetable broth",
                "2 tablespoons soy sauce",
                "1 tablespoon Shaoxing wine",
                "1 teaspoon sugar",
                "1 teaspoon Sichuan peppercorns, toasted and ground",
                "2 tablespoons cornstarch mixed with 2 tablespoons water (slurry)",
                "2 green onions, chopped",
                "2 tablespoons vegetable oil"
            ],
            "instructions": [
                "Heat the vegetable oil in a large skillet or wok over medium heat.",
                "Add the minced garlic, ginger, and fermented black beans to the skillet. Stir-fry until fragrant, about 30 seconds.",
                "Add the ground pork or beef to the skillet. Cook until browned, breaking it up with a spoon.",
                "Stir in the doubanjiang and cook for another minute.",
                "Add the chicken or vegetable broth, soy sauce, Shaoxing wine, sugar, and ground Sichuan peppercorns. Bring to a simmer.",
                "Gently add the tofu cubes to the skillet. Simmer for 5-7 minutes, allowing the tofu to absorb the flavors of the sauce.",
                "Stir in the cornstarch slurry to thicken the sauce. Cook until the sauce has thickened and coats the back of a spoon.",
                "Adjust seasoning with salt and pepper, if needed.",
                "Garnish with chopped green onions before serving.",
                "Serve hot with steamed rice."
            ]
        }
    },
    {
        "id": "CH-0007",
        "name": "Spicy Kung Pao Chicken",
        "description": "Spicy Kung Pao Chicken is a popular Chinese stir-fry dish that features tender chicken pieces, peanuts, and dried chili peppers cooked in a spicy and tangy sauce made from soy sauce, vinegar, sugar, and Sichuan peppercorns. It is often garnished with green onions and served with steamed rice, offering a delightful balance of heat and flavor.",
        "image": "data/images/chiD_img/spicy_kung_pao_chicken.jpg",
        "recipe": {
            "ingredients": [
                "1 pound boneless, skinless chicken breasts, cut into bite-sized pieces",
                "½ cup roasted peanuts",
                "4-6 dried red chili peppers, chopped",
                "2 cloves garlic, minced",
                "1-inch piece ginger, minced",
                "2 green onions, chopped",
                "2 tablespoons vegetable oil",
                "For the marinade:",
                "1 tablespoon soy sauce",
                "1 tablespoon Shaoxing wine",
                "1 teaspoon cornstarch",
                "For the sauce:",
                "2 tablespoons soy sauce",
                "1 tablespoon rice vinegar",
                "1 tablespoon hoisin sauce",
                "1 tablespoon sugar",
                "1 teaspoon cornstarch dissolved in 2 tablespoons water (slurry)"
            ],
            "instructions": [
                "In a bowl, combine the chicken pieces with the marinade ingredients: soy sauce, Shaoxing wine, and cornstarch. Let marinate for 15-30 minutes.",
                "In a separate bowl, mix together the sauce ingredients: soy sauce, rice vinegar, hoisin sauce, sugar, and cornstarch slurry. Set aside.",
                "Heat the vegetable oil in a large skillet or wok over high heat.",
                "Add the chopped dried red chili peppers to the skillet. Stir-fry for 30 seconds to release the aroma.",
                "Add the marinated chicken pieces to the skillet. Stir-fry until cooked through and slightly browned, about 5-7 minutes.",
                "Stir in the minced garlic and ginger. Cook for another minute.",
                "Pour the sauce mixture into the skillet. Stir well to coat the chicken evenly.",
                "Add the roasted peanuts and chopped green onions to the skillet. Stir-fry for another minute, until everything is heated through and the sauce has thickened.",
                "Adjust seasoning with soy sauce or sugar, if needed.",
                "Garnish with additional chopped green onions before serving.",
                "Serve hot with steamed rice."
            ]
        }
    },
    {
        "id": "CH-0008",
        "name": "Stir-fried Beef with Rice Noodles",
        "description": "Stir-fried Beef with Rice Noodles is a popular Cantonese dish consisting of tender beef slices, flat rice noodles, and crisp vegetables stir-fried together in a savory sauce made from oyster sauce, soy sauce, and other seasonings. This dish is quick and easy to prepare, making it a perfect choice for a delicious weeknight meal.",
        "image": "data/images/chiD_img/stir_fried_beef_with_rice_noodles.jpg",
        "recipe": {
            "ingredients": [
                "8 oz flat rice noodles",
                "8 oz beef sirloin, thinly sliced",
                "2 tablespoons vegetable oil",
                "2 cloves garlic, minced",
                "1 onion, sliced",
                "1 bell pepper, sliced",
                "2 cups broccoli florets",
                "2 tablespoons oyster sauce",
                "2 tablespoons soy sauce",
                "1 tablespoon sugar",
                "1 teaspoon sesame oil",
                "Salt and pepper, to taste",
                "Chopped green onions, for garnish"
            ],
            "instructions": [
                "Cook the rice noodles according to the package instructions. Drain and set aside.",
                "In a bowl, marinate the sliced beef with soy sauce and sesame oil. Set aside for 10-15 minutes.",
                "Heat 1 tablespoon of vegetable oil in a large skillet or wok over high heat.",
                "Add the marinated beef to the skillet. Stir-fry until browned and cooked through, about 2-3 minutes. Remove from the skillet and set aside.",
                "In the same skillet, heat the remaining tablespoon of vegetable oil. Add the minced garlic and cook until fragrant, about 30 seconds.",
                "Add the sliced onion, bell pepper, and broccoli florets to the skillet. Stir-fry until crisp-tender, about 3-4 minutes.",
                "Return the cooked beef to the skillet. Add the cooked rice noodles, oyster sauce, soy sauce, and sugar. Stir-fry until everything is heated through and evenly coated with the sauce.",
                "Adjust seasoning with salt and pepper, if needed.",
                "Garnish with chopped green onions before serving.",
                "Serve hot as a main dish."
            ]
        }
    },
    {
        "id": "CH-0009",
        "name": "Sweet and Sour Pork Tenderloin",
        "description": "Sweet and Sour Pork Tenderloin is a classic Chinese dish featuring crispy pork tenderloin pieces coated in a tangy sweet and sour sauce made from vinegar, sugar, ketchup, and soy sauce. It is typically served with bell peppers, onions, and pineapple chunks, creating a colorful and flavorful dish that is sure to satisfy your cravings.",
        "image": "data/images/chiD_img/sweet_and_sour_pork_tenderloin.jpg",
        "recipe": {
            "ingredients": [
                "1 pound pork tenderloin, cut into bite-sized pieces",
                "½ cup cornstarch",
                "2 eggs, beaten",
                "Vegetable oil, for frying",
                "1 onion, cut into chunks",
                "1 bell pepper, cut into chunks",
                "1 cup pineapple chunks",
                "For the sweet and sour sauce:",
                "½ cup ketchup",
                "¼ cup rice vinegar",
                "¼ cup brown sugar",
                "2 tablespoons soy sauce",
                "1 tablespoon cornstarch dissolved in 2 tablespoons water (slurry)"
            ],
            "instructions": [
                "In a bowl, toss the pork tenderloin pieces with cornstarch until evenly coated.",
                "Dip the cornstarch-coated pork pieces into the beaten eggs, shaking off any excess.",
                "Heat vegetable oil in a large skillet or wok over medium-high heat.",
                "Fry the pork pieces in batches until golden brown and crispy, about 3-4 minutes per side. Remove from the skillet and drain on paper towels.",
                "In the same skillet, add a little more oil if needed. Add the onion and bell pepper chunks. Stir-fry until crisp-tender, about 3-4 minutes.",
                "Add the pineapple chunks to the skillet and cook for another minute.",
                "In a small bowl, whisk together the ketchup, rice vinegar, brown sugar, and soy sauce to make the sweet and sour sauce.",
                "Pour the sauce into the skillet with the vegetables. Bring to a simmer.",
                "Stir in the cornstarch slurry to thicken the sauce. Cook until the sauce has thickened and coats the back of a spoon.",
                "Return the fried pork pieces to the skillet. Stir until evenly coated with the sauce.",
                "Adjust seasoning with soy sauce or sugar, if needed.",
                "Serve hot with steamed rice."
            ]
        }
    }
]